docs/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-04-17 Sat 18:53 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Florent Collin</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Florent Collin">
<link rel="stylesheet" type="text/css" href="about.css" />
</head>
<body>
<div id="preamble" class="status">
<a class="logo" href="index.html">FLORENT COLLIN</a>
<nav>
  <ul class="nav_links">
    <li><a href="posts.html">Posts</a></li>
    <li><a href="Florent-Collin-Resume.pdf">Résumé</a></li>
  </ul>
</nav>
</div>
<div id="content">
<header>
<h1 class="title">Florent Collin</h1>
<p class="subtitle">Master Student in Computer Science</p>
</header><p>
<b><b>Hey there ! 👋</b></b>
</p>
<blockquote>
<p>
I'm a student developer at UMons with a back-end experience, I am currently focusing on learning low-level programming, graphics rendering and graphics manipulation.
I'm also interested in classical AI and there applications in games.
For my master degree, I'm working on a analysis of scheduling functions for Low-Power and Lossy Networks.
</p>

<p>
Currently searching for an internship, so feel free to <a href="mailto:florentcollinpro@gmail.com">reach me !</a>
</p>
</blockquote>

<div id="outline-container-orgc3aef08" class="outline-2">
<h2 id="orgc3aef08">Work Experience</h2>
<div class="outline-text-2" id="text-orgc3aef08">
<p>
<b>Student Assistant • UMons (Mons, 2020 - 2021)</b>
</p>
<ul class="org-ul">
<li>Assisted 80 first-year students during their hands-on programming and algorithmic courses in Python and Java.</li>
</ul>

<p>
<b>Algorithms Lab's Intern • UMons (Mons, August 2020)</b>
</p>
<ul class="org-ul">
<li>Developed and implemented a time-based shortest path algorithm in C++ using QGIS and OpenStreetMap.</li>
<li>Optimized the code to calculate in the order of milliseconds the fastest paths to reach any node in a city graph with thousands of nodes and edges.</li>
</ul>

<p>
<b>Back-end Developer • Open Summer of Code (Remote, July 2020)</b> | <a href="https://osoc.be/editions/2020/simplification-election-procedures">WEBSITE</a>
</p>
<ul class="org-ul">
<li>Built a system to decentralize electoral data and provide a simple interface for citizens to access that data.</li>
<li>Designed and implemented the data pipeline from the candidate forms to the front-end using Link Data, Solid and a Python API.</li>
</ul>

<p>
<b>Back-end Developer • Open Summer of Code (Brussels, July 2019)</b> | <a href="https://osoc.be/editions/2019/data-monitor">WEBSITE</a>
</p>
<ul class="org-ul">
<li>Built a Node.Js/React website that shows the quality of Dutch mobility data on a map.</li>
<li>Developed the back-end server using PostGIS to process geospatial queries.</li>
</ul>

<p>
<b>Student Assistant • UMons (Mons, August 2018)</b>
</p>
<ul class="org-ul">
<li>Organized lessons that enabled students to successfully complete their first year in</li>
</ul>
<p>
computer science, math and physics.
</p>
</div>
</div>

<div id="outline-container-org1488a97" class="outline-2">
<h2 id="org1488a97">Projects</h2>
<div class="outline-text-2" id="text-org1488a97">
<p>
<b>Scheduling Functions in Wireless Sensors Network (2020 - 2021)</b>
</p>
<ul class="org-ul">
<li>Analyzed the behavior of diﬀerent scheduling functions for Wireless Sensors Networks in a simulator.</li>
</ul>

<p>
<b>Community Detection in Graphs (2020)</b>
</p>
<ul class="org-ul">
<li>Built an evolutionary algorithm in Python that solves the community detection problem.</li>
<li>Implemented a multi-threading version which has greatly increased performances.</li>
</ul>

<p>
<b>Multiplayer turn-based Game • Slay (2019)</b> | <a href="https://github.com/FlorentCollin/Slay-Groupe1-PGL-2018-2019">GITHUB</a>
</p>
<ul class="org-ul">
<li>Developed a multiplayer game over a network connection where each player must ﬁght their enemies with soldiers to gain territory.</li>
<li>A server was developed in Java with a multi-threaded approach to handle several game rooms concurrently.</li>
</ul>

<p>
<b>Puzzle Game • Baba is You (2018)</b> | <a href="https://github.com/FlorentCollin/baba-is-you">GITHUB</a>
</p>
<ul class="org-ul">
<li>Recreated the first levels of the famous game: Baba is You. A puzzle game where the player can change the rules by pushing blocks and win in many different ways.</li>
</ul>
</div>
</div>

<div id="outline-container-orge98e411" class="outline-2">
<h2 id="orge98e411">Relevant Courses</h2>
<div class="outline-text-2" id="text-orge98e411">
<ul class="org-ul">
<li>Graphs &amp; Artificial Intelligence</li>
<li>Databases</li>
<li>Networks</li>
<li>Compilers</li>
<li>Combinatorial Optimization</li>
<li>Model Checking</li>
</ul>
</div>
</div>
</div>
</body>
</html>